TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s1.h
/* I2S1_SPGDMATXSZ Bits */
/* I2S1_SPGDMATXSZ[SIZE] Bits */
#define I2S1_SPGDMATXSZ_SIZE_OFS                 (0)                             /* !< SIZE Offset */
#define I2S1_SPGDMATXSZ_SIZE_MASK                ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define I2S1_SPGDMATXSZ_SIZE_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S1_SPGDMATXSZ_SIZE_MAXIMUM             ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* I2S1_SPGDMATXSA Bits */
/* I2S1_SPGDMATXSA[ADDR] Bits */
#define I2S1_SPGDMATXSA_ADDR_OFS                 (0)                             /* !< ADDR Offset */
#define I2S1_SPGDMATXSA_ADDR_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define I2S1_SPGDMATXSA_ADDR_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S1_SPGDMATXSA_ADDR_MAXIMUM             ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S1_SPGDMATXCTL Bits */
/* I2S1_SPGDMATXCTL[DMAEN] Bits */
#define I2S1_SPGDMATXCTL_DMAEN_OFS               (1)                             /* !< DMAEN Offset */
#define I2S1_SPGDMATXCTL_DMAEN_MASK              ((uint32_t)0x00000002U)         /* !< DMA enable */
#define I2S1_SPGDMATXCTL_DMAEN_DISABLE           ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define I2S1_SPGDMATXCTL_DMAEN_ENABLE            ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* I2S1_SPGDMATXCTL[DMAMEMINCR] Bits */
#define I2S1_SPGDMATXCTL_DMAMEMINCR_OFS          (20)                            /* !< DMAMEMINCR Offset */
#define I2S1_SPGDMATXCTL_DMAMEMINCR_MASK         ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definitin in the
                                                                                    DMADSTWDTH. For example an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define I2S1_SPGDMATXCTL_DMAMEMINCR_INCREMENT    ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMASRCWDTH) */
#define I2S1_SPGDMATXCTL_DMAMEMINCR_DECREMENT    ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMASRCWDTH) */
/* I2S1_SPGDMATXCTL[DMAPREIRQ] Bits */
#define I2S1_SPGDMATXCTL_DMAPREIRQ_OFS           (24)                            /* !< DMAPREIRQ Offset */
#define I2S1_SPGDMATXCTL_DMAPREIRQ_MASK          ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define I2S1_SPGDMATXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define I2S1_SPGDMATXCTL_DMAPREIRQ_PREIRQ_HALF   ((uint32_t)0x01000000U)         /* !< Issure Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* I2S1_SPGDMATXCTL[DMATM] Bits */
#define I2S1_SPGDMATXCTL_DMATM_OFS               (27)                            /* !< DMATM Offset */
#define I2S1_SPGDMATXCTL_DMATM_MASK              ((uint32_t)0x08000000U)         /* !< DMA transfer mode register  Note:
                                                                                    The repeat-single (2h) and
                                                                                    repeat-block (3h) transfer are only
                                                                                    available in a FULL-channel
                                                                                    configuration. Please consult the
                                                                                    datasheet of the specific device to
                                                                                    map which channel number has FULL or
                                                                                    BASIC capability. In a BASIC channel
                                                                                    configuration only the values for
                                                                                    single (0h) and block (1h) transfer
                                                                                    can be set. */
#define I2S1_SPGDMATXCTL_DMATM_SINGLE            ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfers
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define I2S1_SPGDMATXCTL_DMATM_RPTSNGL           ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfers requires a new trigger.
                                                                                    When the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* I2S1_SPGDMATXCTL[DMASRCWDTH] Bits */
#define I2S1_SPGDMATXCTL_DMASRCWDTH_OFS          (28)                            /* !< DMASRCWDTH Offset */
#define I2S1_SPGDMATXCTL_DMASRCWDTH_MASK         ((uint32_t)0x30000000U)         /* !< DMA source width. This bit selects
                                                                                    the source data width as a byte, half
                                                                                    word, word or long word. */
#define I2S1_SPGDMATXCTL_DMASRCWDTH_BYTE         ((uint32_t)0x00000000U)         /* !< Source data width is BYTE (8-bit) */
#define I2S1_SPGDMATXCTL_DMASRCWDTH_HALF         ((uint32_t)0x10000000U)         /* !< Source data width is HALF-WORD
                                                                                    (16-bit) */
#define I2S1_SPGDMATXCTL_DMASRCWDTH_WORD         ((uint32_t)0x20000000U)         /* !< Source data width is WORD (32-bit) */

