TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s1.h
/* I2S1_IIDX Bits */
/* I2S1_IIDX[STAT] Bits */
#define I2S1_IIDX_STAT_OFS                       (0)                             /* !< STAT Offset */
#define I2S1_IIDX_STAT_MASK                      ((uint32_t)0x000000FFU)         /* !< Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define I2S1_IIDX_STAT_NO_INTR                   ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define I2S1_IIDX_STAT_WCLKERR                   ((uint32_t)0x00000001U)         /* !< WCLK Error */
#define I2S1_IIDX_STAT_RXIFG                     ((uint32_t)0x00000002U)         /* !< Receive interrupt; Interrupt Flag:
                                                                                    RX */
#define I2S1_IIDX_STAT_TXIFG                     ((uint32_t)0x00000003U)         /* !< Transmit interrupt; Interrupt Flag:
                                                                                    TX */
#define I2S1_IIDX_STAT_RXFIFO_OFV_EVT            ((uint32_t)0x00000004U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define I2S1_IIDX_STAT_TXFIFO_UNF_EVT            ((uint32_t)0x00000005U)         /* !< TX FIFO underflow interrupt */
#define I2S1_IIDX_STAT_DMA_DONE_RX               ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define I2S1_IIDX_STAT_DMA_DONE_TX               ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define I2S1_IIDX_STAT_DMA_PREIRQ_RX             ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define I2S1_IIDX_STAT_DMA_PREIRQ_TX             ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

/* I2S1_IMASK Bits */
/* I2S1_IMASK[WCLKERR] Bits */
#define I2S1_IMASK_WCLKERR_OFS                   (0)                             /* !< WCLKERR Offset */
#define I2S1_IMASK_WCLKERR_MASK                  ((uint32_t)0x00000001U)         /* !< WCLKERR interrupt mask */
#define I2S1_IMASK_WCLKERR_DIS                   ((uint32_t)0x00000000U)         /* !< Disable the interrupt mask */
#define I2S1_IMASK_WCLKERR_EN                    ((uint32_t)0x00000001U)         /* !< Enable the interrupt mask */
/* I2S1_IMASK[RXINT] Bits */
#define I2S1_IMASK_RXINT_OFS                     (1)                             /* !< RXINT Offset */
#define I2S1_IMASK_RXINT_MASK                    ((uint32_t)0x00000002U)         /* !< Enable Receive Interrupt. */
#define I2S1_IMASK_RXINT_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S1_IMASK_RXINT_SET                     ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2S1_IMASK[TXINT] Bits */
#define I2S1_IMASK_TXINT_OFS                     (2)                             /* !< TXINT Offset */
#define I2S1_IMASK_TXINT_MASK                    ((uint32_t)0x00000004U)         /* !< Enable Transmit Interrupt. */
#define I2S1_IMASK_TXINT_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S1_IMASK_TXINT_SET                     ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2S1_IMASK[RXFIFO_OVF] Bits */
#define I2S1_IMASK_RXFIFO_OVF_OFS                (3)                             /* !< RXFIFO_OVF Offset */
#define I2S1_IMASK_RXFIFO_OVF_MASK               ((uint32_t)0x00000008U)         /* !< RXFIFO overflow event mask. */
#define I2S1_IMASK_RXFIFO_OVF_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S1_IMASK_RXFIFO_OVF_SET                ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* I2S1_IMASK[TXFIFO_UNF] Bits */
#define I2S1_IMASK_TXFIFO_UNF_OFS                (4)                             /* !< TXFIFO_UNF Offset */
#define I2S1_IMASK_TXFIFO_UNF_MASK               ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt mask */
#define I2S1_IMASK_TXFIFO_UNF_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S1_IMASK_TXFIFO_UNF_SET                ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */

/* I2S1_RIS Bits */
/* I2S1_RIS[WCLKERR] Bits */
#define I2S1_RIS_WCLKERR_OFS                     (0)                             /* !< WCLKERR Offset */
#define I2S1_RIS_WCLKERR_MASK                    ((uint32_t)0x00000001U)         /* !< This interrupt is set when:  - An
                                                                                    unexpected **WCLK** edge occurs
                                                                                    during the data delay period of a
                                                                                    phase.  Note unexpected **WCLK**
                                                                                    edges during the word and idle
                                                                                    periods of the phase are not
                                                                                    detected. -  In dual-phase mode, when
                                                                                    two **WCLK** edges are less than 4
                                                                                    **BCLK** cycles apart. -  In
                                                                                    single-phase mode, when a **WCLK**
                                                                                    pulse occurs before the last channel.
                                                                                    This error requires a complete
                                                                                    restart since word synchronization
                                                                                    has been lost. */
#define I2S1_RIS_WCLKERR_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_RIS_WCLKERR_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* I2S1_RIS[RXINT] Bits */
#define I2S1_RIS_RXINT_OFS                       (1)                             /* !< RXINT Offset */
#define I2S1_RIS_RXINT_MASK                      ((uint32_t)0x00000002U)         /* !< Receive Interrupt. */
#define I2S1_RIS_RXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_RIS_RXINT_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* I2S1_RIS[TXINT] Bits */
#define I2S1_RIS_TXINT_OFS                       (2)                             /* !< TXINT Offset */
#define I2S1_RIS_TXINT_MASK                      ((uint32_t)0x00000004U)         /* !< Transmit Interrupt. */
#define I2S1_RIS_TXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_RIS_TXINT_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* I2S1_RIS[RXFIFO_OVF] Bits */
#define I2S1_RIS_RXFIFO_OVF_OFS                  (3)                             /* !< RXFIFO_OVF Offset */
#define I2S1_RIS_RXFIFO_OVF_MASK                 ((uint32_t)0x00000008U)         /* !< RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define I2S1_RIS_RXFIFO_OVF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_RIS_RXFIFO_OVF_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* I2S1_RIS[TXFIFO_UNF] Bits */
#define I2S1_RIS_TXFIFO_UNF_OFS                  (4)                             /* !< TXFIFO_UNF Offset */
#define I2S1_RIS_TXFIFO_UNF_MASK                 ((uint32_t)0x00000010U)         /* !< TX FIFO Underflow Interrupt */
#define I2S1_RIS_TXFIFO_UNF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_RIS_TXFIFO_UNF_SET                  ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

