TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s1.h
/* I2S1_MIS Bits */
/* I2S1_MIS[WCLKERR] Bits */
#define I2S1_MIS_WCLKERR_OFS                     (0)                             /* !< WCLKERR Offset */
#define I2S1_MIS_WCLKERR_MASK                    ((uint32_t)0x00000001U)         /* !< This interrupt is set when:  - An
                                                                                    unexpected **WCLK** edge occurs
                                                                                    during the data delay period of a
                                                                                    phase.  Note unexpected **WCLK**
                                                                                    edges during the word and idle
                                                                                    periods of the phase are not
                                                                                    detected. -  In dual-phase mode, when
                                                                                    two **WCLK** edges are less than 4
                                                                                    **BCLK** cycles apart. -  In
                                                                                    single-phase mode, when a **WCLK**
                                                                                    pulse occurs before the last channel.
                                                                                    This error requires a complete
                                                                                    restart since word synchronization
                                                                                    has been lost. */
#define I2S1_MIS_WCLKERR_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_WCLKERR_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* I2S1_MIS[RXINT] Bits */
#define I2S1_MIS_RXINT_OFS                       (1)                             /* !< RXINT Offset */
#define I2S1_MIS_RXINT_MASK                      ((uint32_t)0x00000002U)         /* !< Masked Receive Interrupt. */
#define I2S1_MIS_RXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_RXINT_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* I2S1_MIS[TXINT] Bits */
#define I2S1_MIS_TXINT_OFS                       (2)                             /* !< TXINT Offset */
#define I2S1_MIS_TXINT_MASK                      ((uint32_t)0x00000004U)         /* !< Masked Transmit Interrupt. */
#define I2S1_MIS_TXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_TXINT_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* I2S1_MIS[DMA_DONE_RX] Bits */
#define I2S1_MIS_DMA_DONE_RX_OFS                 (15)                            /* !< DMA_DONE_RX Offset */
#define I2S1_MIS_DMA_DONE_RX_MASK                ((uint32_t)0x00008000U)         /* !< Masked DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S1_MIS_DMA_DONE_RX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_DMA_DONE_RX_SET                 ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* I2S1_MIS[DMA_DONE_TX] Bits */
#define I2S1_MIS_DMA_DONE_TX_OFS                 (16)                            /* !< DMA_DONE_TX Offset */
#define I2S1_MIS_DMA_DONE_TX_MASK                ((uint32_t)0x00010000U)         /* !< Masked DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S1_MIS_DMA_DONE_TX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_DMA_DONE_TX_SET                 ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* I2S1_MIS[RXFIFO_OVF] Bits */
#define I2S1_MIS_RXFIFO_OVF_OFS                  (3)                             /* !< RXFIFO_OVF Offset */
#define I2S1_MIS_RXFIFO_OVF_MASK                 ((uint32_t)0x00000008U)         /* !< Masked RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define I2S1_MIS_RXFIFO_OVF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_RXFIFO_OVF_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* I2S1_MIS[TXFIFO_UNF] Bits */
#define I2S1_MIS_TXFIFO_UNF_OFS                  (4)                             /* !< TXFIFO_UNF Offset */
#define I2S1_MIS_TXFIFO_UNF_MASK                 ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt */
#define I2S1_MIS_TXFIFO_UNF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S1_MIS_TXFIFO_UNF_SET                  ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

/* I2S1_ISET Bits */
/* I2S1_ISET[WCLKERR] Bits */
#define I2S1_ISET_WCLKERR_OFS                    (0)                             /* !< WCLKERR Offset */
#define I2S1_ISET_WCLKERR_MASK                   ((uint32_t)0x00000001U)         /* !< This field sets the interrupt
                                                                                    WCLKERR */
#define I2S1_ISET_WCLKERR_NOEFF                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ISET_WCLKERR_SET                    ((uint32_t)0x00000001U)         /* !< Set interrupt */
/* I2S1_ISET[RXINT] Bits */
#define I2S1_ISET_RXINT_OFS                      (1)                             /* !< RXINT Offset */
#define I2S1_ISET_RXINT_MASK                     ((uint32_t)0x00000002U)         /* !< Set Receive Interrupt. */
#define I2S1_ISET_RXINT_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ISET_RXINT_SET                      ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* I2S1_ISET[TXINT] Bits */
#define I2S1_ISET_TXINT_OFS                      (2)                             /* !< TXINT Offset */
#define I2S1_ISET_TXINT_MASK                     ((uint32_t)0x00000004U)         /* !< Set Transmit Interrupt. */
#define I2S1_ISET_TXINT_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ISET_TXINT_SET                      ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* I2S1_ISET[RXFIFO_OVF] Bits */
#define I2S1_ISET_RXFIFO_OVF_OFS                 (3)                             /* !< RXFIFO_OVF Offset */
#define I2S1_ISET_RXFIFO_OVF_MASK                ((uint32_t)0x00000008U)         /* !< Set RXFIFO overflow event. */
#define I2S1_ISET_RXFIFO_OVF_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ISET_RXFIFO_OVF_SET                 ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* I2S1_ISET[TXFIFO_UNF] Bits */
#define I2S1_ISET_TXFIFO_UNF_OFS                 (4)                             /* !< TXFIFO_UNF Offset */
#define I2S1_ISET_TXFIFO_UNF_MASK                ((uint32_t)0x00000010U)         /* !< Set TX FIFO Underflow Event */
#define I2S1_ISET_TXFIFO_UNF_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define I2S1_ISET_TXFIFO_UNF_SET                 ((uint32_t)0x00000010U)         /* !< Set interrupt */

/* I2S1_ICLR Bits */
/* I2S1_ICLR[WCLKERR] Bits */
#define I2S1_ICLR_WCLKERR_OFS                    (0)                             /* !< WCLKERR Offset */
#define I2S1_ICLR_WCLKERR_MASK                   ((uint32_t)0x00000001U)         /* !< This field clears the interrupt
                                                                                    WCLKERR */
#define I2S1_ICLR_WCLKERR_NOEFF                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ICLR_WCLKERR_CLR                    ((uint32_t)0x00000001U)         /* !< Clear interrupt */
/* I2S1_ICLR[RXINT] Bits */
#define I2S1_ICLR_RXINT_OFS                      (1)                             /* !< RXINT Offset */
#define I2S1_ICLR_RXINT_MASK                     ((uint32_t)0x00000002U)         /* !< Clear Receive Interrupt. */
#define I2S1_ICLR_RXINT_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ICLR_RXINT_CLR                      ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* I2S1_ICLR[TXINT] Bits */
#define I2S1_ICLR_TXINT_OFS                      (2)                             /* !< TXINT Offset */
#define I2S1_ICLR_TXINT_MASK                     ((uint32_t)0x00000004U)         /* !< Clear Transmit Interrupt. */
#define I2S1_ICLR_TXINT_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ICLR_TXINT_CLR                      ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* I2S1_ICLR[RXFIFO_OVF] Bits */
#define I2S1_ICLR_RXFIFO_OVF_OFS                 (3)                             /* !< RXFIFO_OVF Offset */
#define I2S1_ICLR_RXFIFO_OVF_MASK                ((uint32_t)0x00000008U)         /* !< Clear RXFIFO overflow event. */
#define I2S1_ICLR_RXFIFO_OVF_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_ICLR_RXFIFO_OVF_CLR                 ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* I2S1_ICLR[TXFIFO_UNF] Bits */
#define I2S1_ICLR_TXFIFO_UNF_OFS                 (4)                             /* !< TXFIFO_UNF Offset */
#define I2S1_ICLR_TXFIFO_UNF_MASK                ((uint32_t)0x00000010U)         /* !< Clear TXFIFO underflow event */
#define I2S1_ICLR_TXFIFO_UNF_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define I2S1_ICLR_TXFIFO_UNF_CLR                 ((uint32_t)0x00000010U)         /* !< Clear interrupt */

/* I2S1_PWREN Bits */
/* I2S1_PWREN[ENABLE] Bits */
#define I2S1_PWREN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define I2S1_PWREN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable the power */
#define I2S1_PWREN_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Power */
#define I2S1_PWREN_ENABLE_ENABLE                 ((uint32_t)0x00000001U)         /* !< Enable Power */
/* I2S1_PWREN[KEY] Bits */
#define I2S1_PWREN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define I2S1_PWREN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define I2S1_PWREN_KEY_UNLOCK_W                  ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* I2S1_RSTCTL Bits */
/* I2S1_RSTCTL[RESETSTKYCLR] Bits */
#define I2S1_RSTCTL_RESETSTKYCLR_OFS             (1)                             /* !< RESETSTKYCLR Offset */
#define I2S1_RSTCTL_RESETSTKYCLR_MASK            ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define I2S1_RSTCTL_RESETSTKYCLR_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_RSTCTL_RESETSTKYCLR_CLR             ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* I2S1_RSTCTL[RESETASSERT] Bits */
#define I2S1_RSTCTL_RESETASSERT_OFS              (0)                             /* !< RESETASSERT Offset */
#define I2S1_RSTCTL_RESETASSERT_MASK             ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define I2S1_RSTCTL_RESETASSERT_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S1_RSTCTL_RESETASSERT_ASSERT           ((uint32_t)0x00000001U)         /* !< Assert reset */
/* I2S1_RSTCTL[KEY] Bits */
#define I2S1_RSTCTL_KEY_OFS                      (24)                            /* !< KEY Offset */
#define I2S1_RSTCTL_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define I2S1_RSTCTL_KEY_UNLOCK_W                 ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* I2S1_CLKCFG Bits */
/* I2S1_CLKCFG[KEY] Bits */
#define I2S1_CLKCFG_KEY_OFS                      (24)                            /* !< KEY Offset */
#define I2S1_CLKCFG_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define I2S1_CLKCFG_KEY_UNLOCK                   ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* I2S1_CLKCFG[BLOCKASYNC] Bits */
#define I2S1_CLKCFG_BLOCKASYNC_OFS               (8)                             /* !< BLOCKASYNC Offset */
#define I2S1_CLKCFG_BLOCKASYNC_MASK              ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define I2S1_CLKCFG_BLOCKASYNC_DISABLE           ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define I2S1_CLKCFG_BLOCKASYNC_ENABLE            ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* I2S1_GPRCM_STAT Bits */
/* I2S1_GPRCM_STAT[RESETSTKY] Bits */
#define I2S1_GPRCM_STAT_RESETSTKY_OFS            (16)                            /* !< RESETSTKY Offset */
#define I2S1_GPRCM_STAT_RESETSTKY_MASK           ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define I2S1_GPRCM_STAT_RESETSTKY_NORES          ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define I2S1_GPRCM_STAT_RESETSTKY_RESET          ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* I2S1_PDBGCTL Bits */
/* I2S1_PDBGCTL[FREE] Bits */
#define I2S1_PDBGCTL_FREE_OFS                    (0)                             /* !< FREE Offset */
#define I2S1_PDBGCTL_FREE_MASK                   ((uint32_t)0x00000001U)         /* !< Free run control */
#define I2S1_PDBGCTL_FREE_STOP                   ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define I2S1_PDBGCTL_FREE_RUN                    ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* I2S1_PDBGCTL[SOFT] Bits */
#define I2S1_PDBGCTL_SOFT_OFS                    (1)                             /* !< SOFT Offset */
#define I2S1_PDBGCTL_SOFT_MASK                   ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define I2S1_PDBGCTL_SOFT_IMMEDIATE              ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define I2S1_PDBGCTL_SOFT_DELAYED                ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* I2S1_INTCTL Bits */
/* I2S1_INTCTL[INTEVAL] Bits */
#define I2S1_INTCTL_INTEVAL_OFS                  (0)                             /* !< INTEVAL Offset */
#define I2S1_INTCTL_INTEVAL_MASK                 ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define I2S1_INTCTL_INTEVAL_DISABLE              ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define I2S1_INTCTL_INTEVAL_EVAL                 ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

