TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s1.h
/* I2S1_FMTCFG Bits */
/* I2S1_FMTCFG[WORDLEN] Bits */
#define I2S1_FMTCFG_WORDLEN_OFS                  (0)                             /* !< WORDLEN Offset */
#define I2S1_FMTCFG_WORDLEN_MASK                 ((uint32_t)0x0000001FU)         /* !< Number of bits per word (8-32): In
                                                                                    single-phase format, this is the
                                                                                    exact number of bits per word.  In
                                                                                    dual-phase format, this is the
                                                                                    maximum number of bits per word.
                                                                                    Values below 8 and above 32 give
                                                                                    undefined behavior. Data written to
                                                                                    memory is always aligned to 16 or 32
                                                                                    bits as defined by [MEMLEN32]. Bit
                                                                                    widths that differ from this
                                                                                    alignment will either be truncated or
                                                                                    zero padded. */
/* I2S1_FMTCFG[DUALPHASE] Bits */
#define I2S1_FMTCFG_DUALPHASE_OFS                (5)                             /* !< DUALPHASE Offset */
#define I2S1_FMTCFG_DUALPHASE_MASK               ((uint32_t)0x00000020U)         /* !< This field selects between
                                                                                    dual-phase or single-phase format */
#define I2S1_FMTCFG_DUALPHASE_SINGLEPHASE        ((uint32_t)0x00000000U)         /* !< Single-phase: **DSP** format */
#define I2S1_FMTCFG_DUALPHASE_DUALPHASE          ((uint32_t)0x00000020U)         /* !< Dual-phase: **I2S**, **LJF** and
                                                                                    **RJF** formats */
/* I2S1_FMTCFG[SMPLEDGE] Bits */
#define I2S1_FMTCFG_SMPLEDGE_OFS                 (6)                             /* !< SMPLEDGE Offset */
#define I2S1_FMTCFG_SMPLEDGE_MASK                ((uint32_t)0x00000040U)         /* !< This field configures the sample
                                                                                    edge/ transfer edge of data (and
                                                                                    **WCLK**) on **BCLK** */
#define I2S1_FMTCFG_SMPLEDGE_NEGEDGE             ((uint32_t)0x00000000U)         /* !< Data is sampled on the negative
                                                                                    edge and clocked out on the positive
                                                                                    edge. */
#define I2S1_FMTCFG_SMPLEDGE_POSEDGE             ((uint32_t)0x00000040U)         /* !< Data is sampled on the positive
                                                                                    edge and clocked out on the negative
                                                                                    edge. */
/* I2S1_FMTCFG[MEMLEN32] Bits */
#define I2S1_FMTCFG_MEMLEN32_OFS                 (7)                             /* !< MEMLEN32 Offset */
#define I2S1_FMTCFG_MEMLEN32_MASK                ((uint32_t)0x00000080U)         /* !< This register configures the size
                                                                                    of each word stored to or loaded from
                                                                                    memory */
#define I2S1_FMTCFG_MEMLEN32_16BIT               ((uint32_t)0x00000000U)         /* !< 16-bit (one 16 bit access per
                                                                                    sample) */
#define I2S1_FMTCFG_MEMLEN32_32BIT               ((uint32_t)0x00000080U)         /* !< 32-bit(one 32-bit access per
                                                                                    sample) */
/* I2S1_FMTCFG[DATADLY] Bits */
#define I2S1_FMTCFG_DATADLY_OFS                  (8)                             /* !< DATADLY Offset */
#define I2S1_FMTCFG_DATADLY_MASK                 ((uint32_t)0x0000FF00U)         /* !< This field configures the number of
                                                                                    **BCLK** periods between a **WCLK**
                                                                                    edge and **MSB** of the first word in
                                                                                    a phase  Note: When 0, **MSB** of the
                                                                                    next word will be output in the idle
                                                                                    period between **LSB** of the
                                                                                    previous word and the start of the
                                                                                    next word. Otherwise logical 0 will
                                                                                    be output until the data delay has
                                                                                    expired. */
#define I2S1_FMTCFG_DATADLY_ZERO                 ((uint32_t)0x00000000U)         /* !< Zero **BCLK** periods - **LJF** and
                                                                                    **DSP** formats */
#define I2S1_FMTCFG_DATADLY_ONE                  ((uint32_t)0x00000100U)         /* !< One **BCLK** periods - **I2S** and
                                                                                    **DSP** formats */
#define I2S1_FMTCFG_DATADLY_TWO                  ((uint32_t)0x00000200U)         /* !< Two(Min) **BCLK** periods - **RJF**
                                                                                    format */
#define I2S1_FMTCFG_DATADLY_MAX                  ((uint32_t)0x0000FF00U)         /* !< Max(255) **BCLK** periods - **RJF**
                                                                                    format */
/* I2S1_FMTCFG[SUSPEND] Bits */
#define I2S1_FMTCFG_SUSPEND_OFS                  (24)                            /* !< SUSPEND Offset */
#define I2S1_FMTCFG_SUSPEND_MASK                 ((uint32_t)0x01000000U)         /* !< Suspend external communication */
#define I2S1_FMTCFG_SUSPEND_DISABLE              ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define I2S1_FMTCFG_SUSPEND_ENABLE               ((uint32_t)0x01000000U)         /* !< External communication suspended */
/* I2S1_FMTCFG[ENABLE] Bits */
#define I2S1_FMTCFG_ENABLE_OFS                   (31)                            /* !< ENABLE Offset */
#define I2S1_FMTCFG_ENABLE_MASK                  ((uint32_t)0x80000000U)         /* !< I2S Module Enable.       If the I2S
                                                                                    is disabled in the middle of
                                                                                    transmission or reception, it
                                                                                    completes the current character
                                                                                    before stopping.      If ENABLE bit
                                                                                    is not set, all registers can still
                                                                                    be accessed and updated. It is
                                                                                    recommended to setup and change I2S
                                                                                    operation mode whhile ENABLE bit is
                                                                                    cleared to avoid unpredictable
                                                                                    behavior during setup or update.
                                                                                    If disabled,  I2S module will not
                                                                                    send or receive any data. */
#define I2S1_FMTCFG_ENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Module */
#define I2S1_FMTCFG_ENABLE_ENABLE                ((uint32_t)0x80000000U)         /* !< Enable module */
/* I2S1_FMTCFG[EMPTYSLOTOUTPUT] Bits */
#define I2S1_FMTCFG_EMPTYSLOTOUTPUT_OFS          (16)                            /* !< EMPTYSLOTOUTPUT Offset */
#define I2S1_FMTCFG_EMPTYSLOTOUTPUT_MASK         ((uint32_t)0x00030000U)         /* !< The field configures the
                                                                                    **EMPTYSLOTOUTPUT** data pin
                                                                                    direction */
#define I2S1_FMTCFG_EMPTYSLOTOUTPUT_ZERO         ((uint32_t)0x00000000U)         /* !< Send out zeroes in empty slots */
#define I2S1_FMTCFG_EMPTYSLOTOUTPUT_ONE          ((uint32_t)0x00010000U)         /* !< send out ones in empty slot */
#define I2S1_FMTCFG_EMPTYSLOTOUTPUT_TRISTATE     ((uint32_t)0x00020000U)         /* !< Tristate line during empty slot */

/* I2S1_CLKCTL Bits */
/* I2S1_CLKCTL[WBEN] Bits */
#define I2S1_CLKCTL_WBEN_OFS                     (0)                             /* !< WBEN Offset */
#define I2S1_CLKCTL_WBEN_MASK                    ((uint32_t)0x00000001U)         /* !< This field configures
                                                                                    **WCLK**/**BCLK** generation */
#define I2S1_CLKCTL_WBEN_DIS                     ((uint32_t)0x00000000U)         /* !< Disables the generation */
#define I2S1_CLKCTL_WBEN_EN                      ((uint32_t)0x00000001U)         /* !< Enable the generation */
/* I2S1_CLKCTL[WCLKPHASE] Bits */
#define I2S1_CLKCTL_WCLKPHASE_OFS                (1)                             /* !< WCLKPHASE Offset */
#define I2S1_CLKCTL_WCLKPHASE_MASK               ((uint32_t)0x00000006U)         /* !< The field configures how the WCLK
                                                                                    division ratio is calculated and used
                                                                                    to generate different duty cycles
                                                                                    (See [WCLKDIV.WDIV]) */
/* I2S1_CLKCTL[MEN] Bits */
#define I2S1_CLKCTL_MEN_OFS                      (3)                             /* !< MEN Offset */
#define I2S1_CLKCTL_MEN_MASK                     ((uint32_t)0x00000008U)         /* !< This field configures the **MCLK**
                                                                                    generation */
#define I2S1_CLKCTL_MEN_DIS                      ((uint32_t)0x00000000U)         /* !< Disable the generation */
#define I2S1_CLKCTL_MEN_EN                       ((uint32_t)0x00000008U)         /* !< Enable the generation */

/* I2S1_STAT Bits */
/* I2S1_STAT[TXFF] Bits */
#define I2S1_STAT_TXFF_OFS                       (6)                             /* !< TXFF Offset */
#define I2S1_STAT_TXFF_MASK                      ((uint32_t)0x00000040U)         /* !< UART Transmit FIFO Full  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define I2S1_STAT_TXFF_CLEARED                   ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define I2S1_STAT_TXFF_SET                       ((uint32_t)0x00000040U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */
/* I2S1_STAT[RXFF] Bits */
#define I2S1_STAT_RXFF_OFS                       (3)                             /* !< RXFF Offset */
#define I2S1_STAT_RXFF_MASK                      ((uint32_t)0x00000008U)         /* !< UART Receive FIFO Full  The meaning
                                                                                    of this bit depends on the state of
                                                                                    the FEN bit in the CTL0 register. */
#define I2S1_STAT_RXFF_CLEARED                   ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define I2S1_STAT_RXFF_SET                       ((uint32_t)0x00000008U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* I2S1_STAT[TXFE] Bits */
#define I2S1_STAT_TXFE_OFS                       (5)                             /* !< TXFE Offset */
#define I2S1_STAT_TXFE_MASK                      ((uint32_t)0x00000020U)         /* !< UART Transmit FIFO Empty  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define I2S1_STAT_TXFE_CLEARED                   ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define I2S1_STAT_TXFE_SET                       ((uint32_t)0x00000020U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is empty. */
/* I2S1_STAT[RXFE] Bits */
#define I2S1_STAT_RXFE_OFS                       (2)                             /* !< RXFE Offset */
#define I2S1_STAT_RXFE_MASK                      ((uint32_t)0x00000004U)         /* !< UART Receive FIFO Empty  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define I2S1_STAT_RXFE_CLEARED                   ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define I2S1_STAT_RXFE_SET                       ((uint32_t)0x00000004U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the receive FIFO is empty. */
/* I2S1_STAT[RXCLR] Bits */
#define I2S1_STAT_RXCLR_OFS                      (4)                             /* !< RXCLR Offset */
#define I2S1_STAT_RXCLR_MASK                     ((uint32_t)0x00000010U)         /* !< RX FIFO Clear Status */
#define I2S1_STAT_RXCLR_CLEARED                  ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define I2S1_STAT_RXCLR_SET                      ((uint32_t)0x00000010U)         /* !< FIFO clear is complete */
/* I2S1_STAT[TXCLR] Bits */
#define I2S1_STAT_TXCLR_OFS                      (7)                             /* !< TXCLR Offset */
#define I2S1_STAT_TXCLR_MASK                     ((uint32_t)0x00000080U)         /* !< TX FIFO Clear Status */
#define I2S1_STAT_TXCLR_CLEARED                  ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define I2S1_STAT_TXCLR_SET                      ((uint32_t)0x00000080U)         /* !< FIFO clear is complete */

/* I2S1_IFLS Bits */
/* I2S1_IFLS[TXIFLSEL] Bits */
#define I2S1_IFLS_TXIFLSEL_OFS                   (0)                             /* !< TXIFLSEL Offset */
#define I2S1_IFLS_TXIFLSEL_MASK                  ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define I2S1_IFLS_TXIFLSEL_LVL_3_4               ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define I2S1_IFLS_TXIFLSEL_LVL_1_2               ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define I2S1_IFLS_TXIFLSEL_LVL_1_4               ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define I2S1_IFLS_TXIFLSEL_LVL_EMPTY             ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define I2S1_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY      ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define I2S1_IFLS_TXIFLSEL_LVL_ALMOST_FULL       ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* I2S1_IFLS[RXIFLSEL] Bits */
#define I2S1_IFLS_RXIFLSEL_OFS                   (4)                             /* !< RXIFLSEL Offset */
#define I2S1_IFLS_RXIFLSEL_MASK                  ((uint32_t)0x00000070U)         /* !< UART Receive Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    receive interrupt are as follows:
                                                                                    Note:    In ULP domain the trigger
                                                                                    levels are used for:   0: LVL_1_4
                                                                                    4: LVL_FULL   For undefined settings
                                                                                    the default configuration is used. */
#define I2S1_IFLS_RXIFLSEL_LVL_1_4               ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define I2S1_IFLS_RXIFLSEL_LVL_1_2               ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define I2S1_IFLS_RXIFLSEL_LVL_3_4               ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define I2S1_IFLS_RXIFLSEL_LVL_FULL              ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define I2S1_IFLS_RXIFLSEL_LVL_ALMOST_FULL       ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define I2S1_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY      ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* I2S1_IFLS[TXCLR] Bits */
#define I2S1_IFLS_TXCLR_OFS                      (3)                             /* !< TXCLR Offset */
#define I2S1_IFLS_TXCLR_MASK                     ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define I2S1_IFLS_TXCLR_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define I2S1_IFLS_TXCLR_ENABLE                   ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* I2S1_IFLS[RXCLR] Bits */
#define I2S1_IFLS_RXCLR_OFS                      (7)                             /* !< RXCLR Offset */
#define I2S1_IFLS_RXCLR_MASK                     ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define I2S1_IFLS_RXCLR_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define I2S1_IFLS_RXCLR_ENABLE                   ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

