TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s1.h
/* I2S1_MCLKDIV Bits */
/* I2S1_MCLKDIV[MDIV] Bits */
#define I2S1_MCLKDIV_MDIV_OFS                    (0)                             /* !< MDIV Offset */
#define I2S1_MCLKDIV_MDIV_MASK                   ((uint32_t)0x000003FFU)         /* !< An unsigned factor of the division
                                                                                    ratio used to generate **MCLK**
                                                                                    [2-1024]:
                                                                                    **MCLK** =
                                                                                    MCUCLK/MDIV[Hz] **MCUCLK** is upto
                                                                                    96MHz.
                                                                                    A value of 0 is
                                                                                    interpreted as 1024.
                                                                                    A value of
                                                                                    1 is invalid.
                                                                                    If MDIV is odd
                                                                                    the low phase of the clock is one
                                                                                    **MCUCLK** period longer than the
                                                                                    high phase. */

/* I2S1_WCLKDIV Bits */
/* I2S1_WCLKDIV[WDIV] Bits */
#define I2S1_WCLKDIV_WDIV_OFS                    (0)                             /* !< WDIV Offset */
#define I2S1_WCLKDIV_WDIV_MASK                   ((uint32_t)0x0000FFFFU)         /* !< If[CLKCTL.WCLKPHASE]= 0, Single
                                                                                    phase. **WCLK**is high
                                                                                    one**BCLK**period and low WDIV[9:0]
                                                                                    (unsigned, [1-1023])**BCLK**periods.
                                                                                    
                                                                                    **WCLK**=**MCUCLK**/
                                                                                    BDIV*(WDIV[9:0] + 1) [Hz]
                                                                                    **MCUCLK**upto 96MHz.
                                                                                    
                                                                                    If[CLKCTL.WCLKPHASE.*]= 1, Dual
                                                                                    phase. Each phase on**WCLK**(50% duty
                                                                                    cycle) is WDIV[9:0] (unsigned,
                                                                                    [1-1023])**BCLK**periods.
                                                                                    
                                                                                    **WCLK**=**MCUCLK**/
                                                                                    BDIV*(2*WDIV[9:0]) [Hz]
                                                                                    
                                                                                    If[CLKCTL.WCLKPHASE.*] = 2, User
                                                                                    defined. **WCLK**is high WDIV[7:0]
                                                                                    (unsigned, [1-255])**BCLK**periods
                                                                                    and low WDIV[15:8] (unsigned,
                                                                                    [1-255])**BCLK**periods.
                                                                                    
                                                                                    **WCLK**=**MCUCLK**/ (BDIV*(WDIV[7:0]
                                                                                    + WDIV[15:8]) [Hz] */

/* I2S1_BCLKDIV Bits */
/* I2S1_BCLKDIV[BDIV] Bits */
#define I2S1_BCLKDIV_BDIV_OFS                    (0)                             /* !< BDIV Offset */
#define I2S1_BCLKDIV_BDIV_MASK                   ((uint32_t)0x000003FFU)         /* !< An unsigned factor of the division
                                                                                    ratio used to generate **BCLK**
                                                                                    [2-1024]:
                                                                                    **BCLK** =
                                                                                    MCUCLK/BDIV[Hz]
                                                                                    A value of 0
                                                                                    is interpreted as 1024.
                                                                                    A value
                                                                                    of 1 is invalid.
                                                                                    If BDIV is
                                                                                    odd and [FMTCFG.SMPLEDGE] = 0, the
                                                                                    low phase of the clock is one
                                                                                    **MCUCLK** period longer than the
                                                                                    high phase.
                                                                                    If BDIV is odd and
                                                                                    [FMTCFG.SMPLEDGE] = 1 , the high
                                                                                    phase of the clock is one **MCUCLK**
                                                                                    period longer than the low phase. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_i2s1__include */

